zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk.c
            /* Save this input parameter for use later, in other functions.
               No error checking is done on this parameter */
            clk1Count1 = count1;

            /* Counting starts when counter1 is written with a nonzero value */
            SRSS_CLK_CAL_CNT1 = clk1Count1;

            retVal = CY_SYSCLK_SUCCESS;
        }

        /* Release the IPC */
        REG_IPC_STRUCT_RELEASE(CY_IPC_STRUCT_PTR(CY_IPC_CHAN_DDFT)) = 0U;
    }

#endif /* ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE))) */

    return (retVal);
}

/* ========================================================================== */
/* ==========================    TRIM SECTION    ============================ */
/* ========================================================================== */


/** \cond INTERNAL */
#define CY_SYSCLK_ILO_TARGET_FREQ  (32768UL)
/* Nominal trim step size is 1.5% of "the frequency". Using the target frequency */
#define CY_SYSCLK_ILO_TRIM_STEP    (CY_SYSLIB_DIV_ROUND(CY_SYSCLK_ILO_TARGET_FREQ * 15UL, 1000UL))

/* The step size to be used by Cy_SysClk_PiloTrim function */
static uint32_t stepSize = CY_SYSCLK_PILO_TRIM_STEP;
/** \endcond */

int32_t Cy_SysClk_IloTrim(uint32_t iloFreq)
{
    int32_t changeInTrim;
#if ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE)))
    (void) iloFreq;
    changeInTrim = (int32_t)CY_PRA_FUNCTION_CALL_RETURN_PARAM(CY_PRA_MSG_TYPE_SECURE_ONLY, CY_PRA_CLK_FUNC_ILO_TRIM, iloFreq);
#else
    uint32_t diff;
    bool sign = false;

    if(iloFreq > (CY_SYSCLK_ILO_TARGET_FREQ + CY_SYSCLK_ILO_TRIM_STEP))
    {
        diff = iloFreq - CY_SYSCLK_ILO_TARGET_FREQ;
    }
    else if (iloFreq < (CY_SYSCLK_ILO_TARGET_FREQ - CY_SYSCLK_ILO_TRIM_STEP))
    {
        diff = CY_SYSCLK_ILO_TARGET_FREQ - iloFreq;
        sign = true;
    }
    else
    {
        diff = 0UL;
    }

    /* Do nothing if iloFreq is already within one trim step from the target */
    if(0UL != diff)
    {
        /* Get current trim value */
        uint32_t trim = _FLD2VAL(SRSS_CLK_TRIM_ILO_CTL_ILO_FTRIM, SRSS_CLK_TRIM_ILO_CTL);

        diff = CY_SYSLIB_DIV_ROUND(diff, CY_SYSCLK_ILO_TRIM_STEP);

        if(sign)
        {
            trim += diff;
        }
        else
        {
            trim -= diff;
        }

        /* Update the trim value */
        CY_REG32_CLR_SET(SRSS_CLK_TRIM_ILO_CTL, SRSS_CLK_TRIM_ILO_CTL_ILO_FTRIM, trim);
    }

    changeInTrim = (sign ? (int32_t)diff : (0L - (int32_t)diff));
#endif /* ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE))) */

    return changeInTrim;
}


/** \cond INTERNAL */
#define CY_SYSCLK_PILO_TARGET_FREQ  (32768UL)
/* nominal trim step size */
#define CY_SYSCLK_PILO_TRIM_STEP        (5UL)
/** \endcond */

int32_t Cy_SysClk_PiloTrim(uint32_t piloFreq)
{
    int32_t changeInTrim;
    uint32_t diff;
    bool sign = false;

    if(piloFreq > (CY_SYSCLK_PILO_TARGET_FREQ + stepSize))
    {
        diff = piloFreq - CY_SYSCLK_PILO_TARGET_FREQ;
    }
    else if (piloFreq < (CY_SYSCLK_PILO_TARGET_FREQ - stepSize))
    {
        diff = CY_SYSCLK_PILO_TARGET_FREQ - piloFreq;
        sign = true;
    }
    else
    {
        diff = 0UL;
    }

    /* Do nothing if piloFreq is already within one trim step from the target */
    if(0UL != diff)
    {
        /* Get current trim value */
        uint32_t trim = Cy_SysClk_PiloGetTrim();

        diff = CY_SYSLIB_DIV_ROUND(diff, stepSize);

        if(sign)
        {/* piloFreq too low. Increase the trim value */
            trim += diff;
            if (trim >= SRSS_CLK_PILO_CONFIG_PILO_FFREQ_Msk) /* limit overflow */
            {
                trim = SRSS_CLK_PILO_CONFIG_PILO_FFREQ_Msk;
            }
        }
        else
        {/* piloFreq too high. Decrease the trim value */
            trim -= diff;
            if ((int32_t)trim < 0) /* limit underflow */
            {
                trim = 0UL;
            }
        }

        /* Update the trim value */
        Cy_SysClk_PiloSetTrim(trim);
    }

    changeInTrim = ((int32_t)(sign ? (int32_t)diff : (0L - (int32_t)diff)));
return changeInTrim;
}
/** \cond INTERNAL */
#define LF_COUNT          (64u)
#define REF_COUNT         (212u)
#define FREQ_REF          (31250u)
#define TRIM_DELAY        (2000u)
#define STEP_SIZE_ITER    (8u)
/** \endcond */



void Cy_SysClk_PiloInitialTrim(void)
{
#if ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE)))
    CY_PRA_FUNCTION_CALL_VOID_VOID(CY_PRA_MSG_TYPE_SECURE_ONLY, CY_PRA_CLK_FUNC_PILO_INITIAL_TRIM);
#else
    uint32_t measuredCnt  = 0xFFFFFFFFUL;
    uint32_t trimVal      = 0UL;
    int32_t  bitPos       = 9;

    do
    {
        SRSS_CLK_PILO_CONFIG &= ~(SRSS_CLK_PILO_CONFIG_PILO_FFREQ_Msk);

        /* Set 1 at BitPos in FTRIM*/
        SRSS_CLK_PILO_CONFIG |= (trimVal | ((uint32_t) 1U  << (uint32_t) bitPos));

        /* Wait for 2 ms after setting FTRIM */
        Cy_SysLib_DelayUs(TRIM_DELAY);
        /* Start frequency measurement of PILO for
         * 64 PILO clock counts with BLE ECO ALTHF(configured to 16MHz) as reference clock */
        (void) Cy_SysClk_StartClkMeasurementCounters(CY_SYSCLK_MEAS_CLK_PILO, LF_COUNT, CY_SYSCLK_MEAS_CLK_ALTHF);
        while ( true != Cy_SysClk_ClkMeasurementCountersDone() )
        {
            /* Wait for the measurement to complete */
        }
        /* Read the number of reference clock cycles for 64 PILO clock cycles */
        measuredCnt = (uint32_t)_FLD2VAL(SRSS_CLK_CAL_CNT2_CAL_COUNTER2, SRSS_CLK_CAL_CNT2);
        /* If the measured clock cycles are greater than expected 31250 cycles, retain the bitPos as 1 in FTRIM */
        if (measuredCnt > FREQ_REF)
        {
            trimVal |= ((uint32_t) 1U << (uint32_t) bitPos);
        }
        /* Repeat until this is done for all 10 bits of FTRIM */
        bitPos--;

    } while (bitPos >= 0);
    SRSS_CLK_PILO_CONFIG &= ~(SRSS_CLK_PILO_CONFIG_PILO_FFREQ_Msk);
    SRSS_CLK_PILO_CONFIG |= (trimVal);
#endif
}


void Cy_SysClk_PiloUpdateTrimStep(void)
{
#if ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE)))
    (void)stepSize;
    CY_PRA_FUNCTION_CALL_VOID_VOID(CY_PRA_MSG_TYPE_SECURE_ONLY, CY_PRA_CLK_FUNC_UPDATE_PILO_TRIM_STEP);
#else
    uint32_t iteration    = 0u;
    uint32_t fTrim        = 0u;
    uint32_t newFreq      = 0u;
    uint32_t oldFreq      = 0u;
    uint32_t initialFtrim = _FLD2VAL(SRSS_CLK_PILO_CONFIG_PILO_FFREQ, SRSS_CLK_PILO_CONFIG);
    uint32_t refClkFreq   = Cy_SysClk_AltHfGetFrequency();

