zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk.c
    stepSize = 8U;

    (void) Cy_SysClk_StartClkMeasurementCounters(CY_SYSCLK_MEAS_CLK_PILO, REF_COUNT, CY_SYSCLK_MEAS_CLK_ALTHF);
    while ( true != Cy_SysClk_ClkMeasurementCountersDone() )
    {
        /* Wait for the measurement to complete */
    }

    oldFreq = Cy_SysClk_ClkMeasurementCountersGetFreq(false, refClkFreq);
    do
    {
        fTrim = _FLD2VAL(SRSS_CLK_PILO_CONFIG_PILO_FFREQ, SRSS_CLK_PILO_CONFIG);
        /* Update the fine trim value */
        CY_REG32_CLR_SET(SRSS_CLK_PILO_CONFIG, SRSS_CLK_PILO_CONFIG_PILO_FFREQ, fTrim + 1u);
        /* Wait for 2 ms after setting FTRIM */
        Cy_SysLib_DelayUs(TRIM_DELAY);
        (void) Cy_SysClk_StartClkMeasurementCounters(CY_SYSCLK_MEAS_CLK_PILO, REF_COUNT, CY_SYSCLK_MEAS_CLK_ALTHF);
        while ( true != Cy_SysClk_ClkMeasurementCountersDone() )
        {
            /* Wait for the measurement to complete */
        }
        newFreq = Cy_SysClk_ClkMeasurementCountersGetFreq(false, refClkFreq);
        stepSize += (newFreq - oldFreq);
        oldFreq = newFreq;
        iteration++;

    } while (iteration < STEP_SIZE_ITER);
    stepSize = (stepSize/STEP_SIZE_ITER);
    /* Restore the fine trim value */
    CY_REG32_CLR_SET(SRSS_CLK_PILO_CONFIG, SRSS_CLK_PILO_CONFIG_PILO_FFREQ, initialFtrim);
    /* Wait for 2 ms after setting FTRIM */
    Cy_SysLib_DelayUs(TRIM_DELAY);
#endif
}


/* ========================================================================== */
/* ======================    POWER MANAGEMENT SECTION    ==================== */
/* ========================================================================== */


/** \cond INTERNAL */
/* Timeout count for use in function Cy_SysClk_DeepSleepCallback() is sufficiently large for ~1 second */
#define TIMEOUT (1000000UL)
/** \endcond */

cy_en_syspm_status_t Cy_SysClk_DeepSleepCallback(cy_stc_syspm_callback_params_t * callbackParams, cy_en_syspm_callback_mode_t mode)
{

    /* Bitmapped paths with enabled FLL/PLL sourced by ECO */
    static uint16_t changedSourcePaths;
    static uint16_t pllAutoModes;

    cy_en_syspm_status_t retVal = CY_SYSPM_FAIL;

    (void)callbackParams; /* Suppress "not used" warning */
    (void)changedSourcePaths;
    (void)pllAutoModes;

    switch (mode)
    {
        case CY_SYSPM_CHECK_READY:
            /* Don't allow entry into Deep Sleep mode if currently measuring a frequency */
            if (!clkCounting)
            {
                /* Indicating that we can go into Deep Sleep.
                 * Prevent starting a new clock measurement until
                 * after we've come back from Deep Sleep.
                 */
                preventCounting = true;
                retVal = CY_SYSPM_SUCCESS;
            }
            break;

        case CY_SYSPM_CHECK_FAIL:
            /* Cancellation of going into Deep Sleep, therefore allow a new clock measurement */
            preventCounting = false;
            retVal = CY_SYSPM_SUCCESS;
            break;

        case CY_SYSPM_BEFORE_TRANSITION:
            {
#if ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE)))
                retVal = (cy_en_syspm_status_t)CY_PRA_FUNCTION_CALL_RETURN_VOID(CY_PRA_MSG_TYPE_SECURE_ONLY, CY_PRA_CLK_FUNC_DS_BEFORE_TRANSITION);
#else
                uint32_t fllpll; /* 0 = FLL, all other values = a PLL */

                /* Initialize the storage of changed paths */
                changedSourcePaths = 0U;
                pllAutoModes = 0U;

                /* For FLL and each PLL */
                for (fllpll = 0UL; fllpll <= CY_SRSS_NUM_PLL; fllpll++)
                {
                    /* If FLL or PLL is enabled */
                    if ((0UL == fllpll) ? Cy_SysClk_FllIsEnabled() : Cy_SysClk_PllIsEnabled(fllpll))
                    {
                        /* And the FLL/PLL has ECO as a source */
                        if (Cy_SysClk_ClkPathGetSource(fllpll) == CY_SYSCLK_CLKPATH_IN_ECO)
                        {
                            /* Bypass the FLL/PLL */
                            if (0UL == fllpll)
                            {
                                CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
                            }
                            else
                            {
                                if (((uint32_t)CY_SYSCLK_FLLPLL_OUTPUT_AUTO  == _FLD2VAL(SRSS_CLK_PLL_CONFIG_BYPASS_SEL, SRSS_CLK_PLL_CONFIG[fllpll - 1UL])) ||
                                    ((uint32_t)CY_SYSCLK_FLLPLL_OUTPUT_AUTO1 == _FLD2VAL(SRSS_CLK_PLL_CONFIG_BYPASS_SEL, SRSS_CLK_PLL_CONFIG[fllpll - 1UL])))
                                {
                                    pllAutoModes |= (uint16_t)(1UL << fllpll);
                                }

                                CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[fllpll - 1UL], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
                            }

                            /* Change this path source to IMO */
                            (void)Cy_SysClk_ClkPathSetSource(fllpll, CY_SYSCLK_CLKPATH_IN_IMO);

                            /* Store a record that this path source was changed from ECO */
                            changedSourcePaths |= (uint16_t)(1UL << fllpll);
                        }
                        else if (0UL == fllpll)
                        {
                            CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
                        }
                        else
                        {
                            /* Do nothing */
                        }
                    }
                }

                retVal = CY_SYSPM_SUCCESS;
#endif /* ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE)))  */
            }
            break;

        case CY_SYSPM_AFTER_TRANSITION:
            {
#if ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE)))
                retVal = (cy_en_syspm_status_t)CY_PRA_FUNCTION_CALL_RETURN_VOID(CY_PRA_MSG_TYPE_SECURE_ONLY, CY_PRA_CLK_FUNC_DS_AFTER_TRANSITION);
#else
                /* After return from Deep Sleep, for each FLL/PLL, if needed, restore the source to ECO.
                 * And block until the FLL/PLL has regained its frequency lock.
                 */
                uint32_t timeout = TIMEOUT;
                retVal = CY_SYSPM_TIMEOUT;

                if (0U != changedSourcePaths)
                {
                    /* If any FLL/PLL was sourced by the ECO, timeout wait for the ECO to become fully stabilized again */
                    while ((CY_SYSCLK_ECOSTAT_STABLE != Cy_SysClk_EcoGetStatus()) && (0UL != timeout))
                    {
                        timeout--;
                    }

                    if (0UL != timeout)
                    {
                        uint32_t fllpll; /* 0 = FLL, all other values = PLL */

                        for (fllpll = 0UL; fllpll <= CY_SRSS_NUM_PLL; fllpll++)
                        {
                            /* If there is a correspondent record about a changed clock source */
                            if (0U != (changedSourcePaths & (uint16_t)(1UL << fllpll)))
                            {
                                /* Change this path source back to ECO */
                                (void)Cy_SysClk_ClkPathSetSource(fllpll, CY_SYSCLK_CLKPATH_IN_ECO);

                                /* Timeout wait for FLL/PLL to regain lock.
                                 * Split FLL and PLL lock polling loops into two separate threads to minimize one polling loop duration.
                                 */
                                if (0UL == fllpll)
                                {
                                    while ((!Cy_SysClk_FllLocked()) && (0UL != timeout))
                                    {
                                        timeout--;
                                    }
                                }
                                else
                                {
                                    while ((!Cy_SysClk_PllLocked(fllpll)) && (0UL != timeout))
                                    {
                                        timeout--;
                                    }
                                }

                                if (0UL != timeout)
                                {
                                    /* Undo bypass the FLL/PLL */
                                    if (0UL == fllpll)
                                    {
                                        CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
                                    }
                                    else
                                    {
                                        if (0U != (pllAutoModes & (uint16_t)(1UL << fllpll)))
                                        {
                                            CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[fllpll - 1UL], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_AUTO);
                                        }
                                        else
                                        {
                                            CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[fllpll - 1UL], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
                                        }
                                    }

