zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk.c
                                    retVal = CY_SYSPM_SUCCESS;
                                }
                            }
                        }
                    }
                }
                else if (Cy_SysClk_FllIsEnabled())
                {
                    /* Timeout wait for FLL to regain lock */
                    while ((!Cy_SysClk_FllLocked()) && (0UL != timeout))
                    {
                        timeout--;
                    }

                    if (0UL != timeout)
                    {
                        /* Undo bypass the FLL */
                        CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
                        retVal = CY_SYSPM_SUCCESS;
                    }
                }
                else
                {
                    retVal = CY_SYSPM_SUCCESS;
                }

                preventCounting = false; /* Allow clock measurement */
#endif /* ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE))) */
            }
            break;

        default: /* Unsupported mode, return CY_SYSPM_FAIL */
            break;
    }

    return (retVal);

}


/* ========================================================================== */
/* =========================    clkHf[n] SECTION    ========================= */
/* ========================================================================== */


uint32_t Cy_SysClk_ClkHfGetFrequency(uint32_t clkHf)
{
    /* variables holding intermediate clock frequencies, dividers and FLL/PLL settings */
    uint32_t pDiv = 1UL << (uint32_t)Cy_SysClk_ClkHfGetDivider(clkHf); /* root prescaler (1/2/4/8) */
    uint32_t path = (uint32_t) Cy_SysClk_ClkHfGetSource(clkHf); /* path input for root 0 (clkHf[0]) */
    uint32_t freq = Cy_SysClk_ClkPathGetFrequency(path);

    /* Divide the path input frequency down and return the result */
    return (CY_SYSLIB_DIV_ROUND(freq, pDiv));
}


/* ========================================================================== */
/* =====================    clk_peripherals SECTION    ====================== */
/* ========================================================================== */


uint32_t Cy_SysClk_PeriphGetFrequency(cy_en_divider_types_t dividerType, uint32_t dividerNum)
{
    uint32_t integer = 0UL;        /* Integer part of peripheral divider */
    uint32_t freq = Cy_SysClk_ClkPeriGetFrequency(); /* Get Peri frequency */

    CY_ASSERT_L1(((dividerType == CY_SYSCLK_DIV_8_BIT)    && (dividerNum < PERI_DIV_8_NR))    || \
                 ((dividerType == CY_SYSCLK_DIV_16_BIT)   && (dividerNum < PERI_DIV_16_NR))   || \
                 ((dividerType == CY_SYSCLK_DIV_16_5_BIT) && (dividerNum < PERI_DIV_16_5_NR)) || \
                 ((dividerType == CY_SYSCLK_DIV_24_5_BIT) && (dividerNum < PERI_DIV_24_5_NR)));

    /* get the divider value for clk_peri to the selected peripheral clock */
    switch(dividerType)
    {
        case CY_SYSCLK_DIV_8_BIT:
        case CY_SYSCLK_DIV_16_BIT:
            integer = 1UL + Cy_SysClk_PeriphGetDivider(dividerType, dividerNum);
            freq = CY_SYSLIB_DIV_ROUND(freq, integer);
            break;

        case CY_SYSCLK_DIV_16_5_BIT:
        case CY_SYSCLK_DIV_24_5_BIT:
            {
                uint32_t locFrac;
                uint32_t locDiv;
                uint64_t locFreq = freq * 32ULL;
                Cy_SysClk_PeriphGetFracDivider(dividerType, dividerNum, &integer, &locFrac);
                /* For fractional dividers, the divider is (int + 1) + frac/32 */
                locDiv = ((1UL + integer) * 32UL) + locFrac;
                freq = (uint32_t) CY_SYSLIB_DIV_ROUND(locFreq, (uint64_t)locDiv);
            }
            break;

        default:
            /* Unknown divider */
            break;
    }

    return (freq);
}


uint32_t Cy_SysClk_ClkTimerGetFrequency(void)
{
    uint32_t freq = 0UL;

    if (Cy_SysClk_ClkTimerIsEnabled())
    {
        freq = Cy_SysClk_ClkHfGetFrequency(0UL);

        switch (Cy_SysClk_ClkTimerGetSource())
        {
            case CY_SYSCLK_CLKTIMER_IN_IMO:
                freq = CY_SYSCLK_IMO_FREQ;
                break;

            case CY_SYSCLK_CLKTIMER_IN_HF0_NODIV:
                break;

            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV2:
                freq /= 2UL;
                break;

            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV4:
                freq /= 4UL;
                break;

            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV8:
                freq /= 8UL;
                break;

            default:
                freq = 0UL;
                break;
        }
    }

    /* Divide the input frequency down and return the result */
    return (CY_SYSLIB_DIV_ROUND(freq, 1UL + (uint32_t)Cy_SysClk_ClkTimerGetDivider()));
}


uint32_t Cy_SysClk_FllGetFrequency(void)
{
    uint32_t fDiv ;    /* FLL multiplier/feedback divider */
    uint32_t rDiv;    /* FLL reference divider */
    uint32_t oDiv;    /* FLL output divider */
    bool  enabled;    /* FLL enable status; n/a for direct */
    uint32_t freq = 0UL;    /* FLL Frequency */

    cy_stc_fll_manual_config_t fllCfg;
    Cy_SysClk_FllGetConfiguration(&fllCfg);
    enabled = (Cy_SysClk_FllIsEnabled()) && (CY_SYSCLK_FLLPLL_OUTPUT_INPUT != fllCfg.outputMode);
    fDiv = fllCfg.fllMult;
    rDiv = fllCfg.refDiv;
    oDiv = (fllCfg.enableOutputDiv) ? 2UL : 1UL;

    if (enabled && /* If FLL is enabled and not bypassed */
        (0UL != rDiv)) /* to avoid division by zero */
    {
        freq = Cy_SysClk_ClkPathMuxGetFrequency(0UL); /* FLL mapped always to path 0 */
        freq = (uint32_t)CY_SYSLIB_DIV_ROUND(((uint64_t)freq * (uint64_t)fDiv),
                                             ((uint64_t)rDiv * (uint64_t)oDiv));
    }

    return (freq);
}

uint32_t Cy_SysClk_PllGetFrequency(uint32_t clkPath)
{
    uint32_t fDiv = 0UL;    /* PLL multiplier/feedback divider */
    uint32_t rDiv = 0UL;    /* PLL reference divider */
    uint32_t oDiv = 0UL;    /* PLL output divider */
    bool  enabled = false;    /* PLL enable status; n/a for direct */
    uint32_t freq=0UL;    /* PLL Frequency */

    if((CY_SRSS_NUM_PLL > 0UL) && (clkPath > 0UL))
    {
        CY_ASSERT_L1(clkPath < CY_SRSS_NUM_CLKPATH);

        if (clkPath <= CY_SRSS_NUM_PLL)
        {
            cy_stc_pll_manual_config_t pllcfg;
            if (CY_SYSCLK_SUCCESS == Cy_SysClk_PllGetConfiguration(clkPath, &pllcfg))
            {
                enabled = (Cy_SysClk_PllIsEnabled(clkPath)) && (CY_SYSCLK_FLLPLL_OUTPUT_INPUT != pllcfg.outputMode);
                fDiv = pllcfg.feedbackDiv;
                rDiv = pllcfg.referenceDiv;
                oDiv = pllcfg.outputDiv;
            }

            if (enabled && /* If PLL is enabled and not bypassed */
            (0UL != rDiv) && (0UL != oDiv)) /* to avoid division by zero */
            {
                freq = Cy_SysClk_ClkPathMuxGetFrequency(clkPath);
                freq = (uint32_t)CY_SYSLIB_DIV_ROUND(((uint64_t)freq * (uint64_t)fDiv),
                                                     ((uint64_t)rDiv * (uint64_t)oDiv));
            }
        }
    }

    return (freq);
}

#if defined (CY_DEVICE_SECURE)
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 17.2')
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 18.6')
#endif

#endif

/* [] END OF FILE */
